{
  "documents": [
    {
      "language": "en",
      "id": "1",
      "text":
        "Very satisfied with the knowledge of the engineers very fast responses you get what you want. A good level for all attendees at the meetings.\nCompared to Fasttrack for Dynamics this is better. We can ask high and low and get responses."
    },
    {
      "language": "en",
      "id": "2",
      "text": "want to get more resources in Azure before making that determination"
    },
    {
      "language": "en",
      "id": "3",
      "text": "until we can figure out the networking issue"
    },
    {
      "language": "en",
      "id": "4",
      "text": "at first FTA were a little behind us might be leveling off now"
    },
    {
      "language": "en",
      "id": "5",
      "text":
        "They shared some real world examples and how other customers have done things so we were given point of comaprison"
    },
    {
      "language": "en",
      "id": "6",
      "text": "always new features are being developped."
    },
    {
      "language": "en",
      "id": "7",
      "text": "Technical knowledge"
    },
    {
      "language": "en",
      "id": "8",
      "text": "Sessions have been very professional and valuable - with deep knowledge of the products."
    },
    {
      "language": "en",
      "id": "9",
      "text": "We dont have a Finish datacentre and hence latency problem - if so it would have been a 10"
    },
    {
      "language": "en",
      "id": "10",
      "text": "Feel more confident"
    },
    {
      "language": "en",
      "id": "11",
      "text":
        "Olga: Huge Microsoft support and always looking to use Azure as a platform within the Louis Berger organization."
    },
    {
      "language": "en",
      "id": "12",
      "text": "Olga: Engineers have been great and very supportive."
    },
    {
      "language": "en",
      "id": "13",
      "text":
        "Olga: We internally haven't set aside our people to work on Azure yet.  This is not FTA's fault but more of an internal Louis Berger issue."
    },
    {
      "language": "en",
      "id": "14",
      "text": "would prefer a middle ground option some aspects better than others"
    },
    {
      "language": "en",
      "id": "15",
      "text":
        "delivered well within the FT framework trainings have gone really well recommendations and links left them feeling hanging on their own - other engineer has provided more concise recommendations specific to customer need"
    },
    {
      "language": "en",
      "id": "16",
      "text": "everyone should try it"
    },
    {
      "language": "en",
      "id": "17",
      "text":
        "Speeds up the whole track to Azure - lots of information regarding it - better with sessions. Documentation as extra information."
    },
    {
      "language": "en",
      "id": "18",
      "text":
        "Will is very knowledgeable - no question is to hard to figure out or get back to us. Great sessions. Explains well and provides lot of information."
    },
    {
      "language": "en",
      "id": "19",
      "text": "Not run into any issues."
    },
    {
      "language": "en",
      "id": "20",
      "text":
        "Personal contact - microsfot has done really good in the few years - they make more personal contact\nFastTrack is a means to do that."
    },
    {
      "language": "en",
      "id": "21",
      "text":
        "Not been to all the contacts - spoke to the partner and they found it VERY valuable (always get new insight) and it helped us make the migration plan clearly."
    },
    {
      "language": "en",
      "id": "22",
      "text": "could have started the FastTrack faster already 2 miles down the road before FTA was engaged."
    },
    {
      "language": "en",
      "id": "23",
      "text":
        "Increase technical knowledge confidence in deploying azure services and economical benefits (scale up. down)"
    },
    {
      "language": "en",
      "id": "24",
      "text": "none - we got all the answers to the questions we had."
    },
    {
      "language": "en",
      "id": "25",
      "text":
        "Olga: Not at the moment.  We are just concentrating on the core of engineers getting to use Azure within her business and making Azure the ideal platform for use within the organization."
    },
    {
      "language": "en",
      "id": "26",
      "text":
        "trying to tailor more to specific customer needs rather than general sharing - and documentation would be nice formal write up of recommendations what was provided etc - use case per industry this is what customer wanted/needed and this is how it was done in Azure early adoption need here's how it was done and here's the features in Azure that helped them accomplish it"
    }
  ]
}
